In [1]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
from sklearn.preprocessing import LabelEncoder
import pandas as pd

In [3]:
data=pd.read_csv(r"C:\Users\DELL\Downloads\archive (2)\Salary_Data.csv")
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [14]:
data=data.dropna()
le=LabelEncoder()
data['Gender']=le.fit_transform(data['Gender'])
data['Education Level']=le.fit_transform(data['Education Level'])
data['Job Title']=le.fit_transform(data['Job Title'])
data.head()

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0       1                0        175                  5.0   90000.0
1  28.0       0                3         18                  3.0   65000.0
2  45.0       1                5        144                 15.0  150000.0
3  36.0       0                0        115                  7.0   60000.0
4  52.0       1                3         25                 20.0  200000.0

In [11]:
gp=data.groupby('Education Level').size()
gpsum=data.groupby('Education Level').sum()
gpmean=data.groupby('Education Level').mean()
print("grouped by size",gp)

grouped by size Education Level
0     756
1    2265
2     448
3     288
4    1572
5    1368
6       1
dtype: int64

In [13]:
y=data['Salary']
x=data.drop('Salary',axis=1)
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.3,random_state=44)
model=LinearRegression()
p=model.fit(xtrain,ytrain)
xt=p.predict(xtest)
print("r2 score is:",r2_score(ytest,xt))

r2 score is: 0.6646930120634257

In [15]:
new=pd.DataFrame({
    'Age':[32],
    'Gender':[1],
    'Education Level':[0],
    'Job Title':[175],
    'Years of Experience':[5.0],
})
xt=p.predict(new)
print("predicted value is:",xt)
print("actual value is:",y[0])

predicted value is: [85624.20662613]
actual value is: 90000.0